In [ ]:
# Aggregation

## 집계함수

In [66]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'name': ['김혜수', '박보검', '송혜교', '아이유', '공유', '전지현', '수지', '유재석', '강동원', '윤아'],
    'department': ['인사', '재무', '재무', 'IT', 'IT', '인사', '재무', '인사', 'IT', '재무'],
    'job': ['사원', '과장', '대리', '사원', '팀장', '대리', '대리', '과장', '사원', '팀장'],
    'branch': ['서울', '부산', '서울', '부산', '서울', '서울', '서울', '부산', '서울', '부산'],
    'salary': [3500, 5000, 4200, 3800, 6000, 4500, 4600, 5200, 3900, 6100],
    'hire_date': ['2020-03-15', '2018-07-10', '2019-05-20', '2021-01-10', '2017-09-25', '2019-03-05', '2020-06-12', '2016-11-30', '2022-04-01', '2017-12-15']
}

df = pd.DataFrame(data)
df

  name department job branch  salary   hire_date
0  김혜수         인사  사원     서울    3500  2020-03-15
1  박보검         재무  과장     부산    5000  2018-07-10
2  송혜교         재무  대리     서울    4200  2019-05-20
3  아이유         IT  사원     부산    3800  2021-01-10
4   공유         IT  팀장     서울    6000  2017-09-25
5  전지현         인사  대리     서울    4500  2019-03-05
6   수지         재무  대리     서울    4600  2020-06-12
7  유재석         인사  과장     부산    5200  2016-11-30
8  강동원         IT  사원     서울    3900  2022-04-01
9   윤아         재무  팀장     부산    6100  2017-12-15

In [4]:
# hire_date 컬럼 자료명 변경
df['hire_date'] = pd.to_datetime(df['hire_date']) # 데이트 타임으로 안되어 있는 상태를 변경
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   department  10 non-null     object
 2   job         10 non-null     object
 3   branch      10 non-null     object
 4   salary      10 non-null     int64
 5   hire_date   10 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 612.0+ bytes

In [6]:
# df레벨 집계함수
# ser레벨 집계함수
df.count()
print(type(df.count()))
df['salary'].count()
print(type(df['salary'].count()))

<class 'pandas.core.series.Series'>
<class 'numpy.int64'>

In [7]:
# df.sum()
df['salary'].sum()

np.int64(46800)

In [8]:
df['salary'].mean()

np.float64(4680.0)

In [9]:
df['salary'].max()

np.int64(6100)

In [10]:
df['salary'].min()

np.int64(3500)

In [11]:
(df['salary'].median())

np.float64(4550.0)

In [12]:
df['salary'].var() # 분산

np.float64(797333.3333333334)

In [ ]:
df['salary'].std() # 표준편차

## groupby
특정 조건에 맞게 행을 그룹핑하는 메소드
DataFrameGroupBy 객체를 반환

In [15]:
groupby_dept = df.groupby('department')
print(type(groupby_dept))
print(groupby_dept.groups)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
{'IT': [3, 4, 8], '인사': [0, 5, 7], '재무': [1, 2, 6, 9]}

In [18]:
# 그룹별 직계함수 조회
print(groupby_dept['salary'])
groupby_dept['salary'].mean()

<pandas.core.groupby.generic.SeriesGroupBy object at 0x000002B486A73A70>

department
IT    4566.666667
인사    4400.000000
재무    4975.000000
Name: salary, dtype: float64

In [19]:
groupby_dept['salary'].max()

department
IT    6000
인사    5200
재무    6100
Name: salary, dtype: int64

In [20]:
# 숫자형 데이터가 아닌 경우 카운팅
groupby_dept['job'].value_counts()

department  job
IT          사원     2
            팀장     1
인사          과장     1
            대리     1
            사원     1
재무          대리     2
            과장     1
            팀장     1
Name: count, dtype: int64

In [22]:
# 날짜형 데이터
groupby_dept['hire_date'].max() # 미래는 과거보다 크다

department
IT   2022-04-01
인사   2020-03-15
재무   2020-06-12
Name: hire_date, dtype: datetime64[ns]

In [23]:
# 집계함수 묶어서 출력 # agg({컬럼명 : 집계함수, ...}), # 컬럼명이 중복되면 맨 마지막게 나온다.
groupby_dept.agg({'salary' : 'mean', 'salary' : 'max', 'hire_date' : 'min'})

            salary  hire_date
department
IT            6000 2017-09-25
인사            5200 2016-11-30
재무            6100 2017-12-15

In [24]:
# name aggregation

groupby_dept.agg(
    salary_mean = ('salary', 'mean'),
    salary_max = ('salary', 'max'),
    hire_date_min = ('hire_date', 'min'),
    hire_date_max = ('hire_date', 'max'),
)

            salary_mean  salary_max hire_date_min hire_date_max
department
IT          4566.666667        6000    2017-09-25    2022-04-01
인사          4400.000000        5200    2016-11-30    2020-03-15
재무          4975.000000        6100    2017-12-15    2020-06-12

In [27]:
# 두 개 이상의 컬럼을 그룹핑
groupby_dept_job = df.groupby(['job', 'department'])
print(groupby_dept_job)
groupby_dept_job.groups

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002B487E1D730>

{('과장', '인사'): [7], ('과장', '재무'): [1], ('대리', '인사'): [5], ('대리', '재무'): [2, 6], ('사원', 'IT'): [3, 8], ('사원', '인사'): [0], ('팀장', 'IT'): [4], ('팀장', '재무'): [9]}

In [28]:
groupby_dept_job.count()

                name  branch  salary  hire_date
job department
과장  인사             1       1       1          1
    재무             1       1       1          1
대리  인사             1       1       1          1
    재무             2       2       2          2
사원  IT             2       2       2          2
    인사             1       1       1          1
팀장  IT             1       1       1          1
    재무             1       1       1          1

In [29]:
groupby_dept_job.value_counts()

job  department  name  branch  salary  hire_date
과장   인사          유재석   부산      5200    2016-11-30    1
     재무          박보검   부산      5000    2018-07-10    1
대리   인사          전지현   서울      4500    2019-03-05    1
     재무          송혜교   서울      4200    2019-05-20    1
                 수지    서울      4600    2020-06-12    1
사원   IT          강동원   서울      3900    2022-04-01    1
                 아이유   부산      3800    2021-01-10    1
     인사          김혜수   서울      3500    2020-03-15    1
팀장   IT          공유    서울      6000    2017-09-25    1
     재무          윤아    부산      6100    2017-12-15    1
Name: count, dtype: int64

In [31]:
# 반복문을 통해 처리 가능
for (name, group) in groupby_dept_job :
    print(name)
    display(group) # 주피터만 사용

('과장', '인사')

  name department job branch  salary  hire_date
7  유재석         인사  과장     부산    5200 2016-11-30

('과장', '재무')

  name department job branch  salary  hire_date
1  박보검         재무  과장     부산    5000 2018-07-10

('대리', '인사')

  name department job branch  salary  hire_date
5  전지현         인사  대리     서울    4500 2019-03-05

('대리', '재무')

  name department job branch  salary  hire_date
2  송혜교         재무  대리     서울    4200 2019-05-20
6   수지         재무  대리     서울    4600 2020-06-12

('사원', 'IT')

  name department job branch  salary  hire_date
3  아이유         IT  사원     부산    3800 2021-01-10
8  강동원         IT  사원     서울    3900 2022-04-01

('사원', '인사')

  name department job branch  salary  hire_date
0  김혜수         인사  사원     서울    3500 2020-03-15

('팀장', 'IT')

  name department job branch  salary  hire_date
4   공유         IT  팀장     서울    6000 2017-09-25

('팀장', '재무')

  name department job branch  salary  hire_date
9   윤아         재무  팀장     부산    6100 2017-12-15

## pivot table
특정 컬러(인덱스, 컬럼)을 기준으로 값 컬럼을 열람하는 기능
연관있는 데이터를 가독성 좋게 출력

In [62]:
data = {
    'Date' : ['2024-10-11','2024-10-12','2024-10-13','2024-10-14', '2024-10-14'],
    'City' : ['서울', '인천', '평택', '화성', '서울'],
    'Temperature' : [17, 18, 19, 81, 20]
}
df = pd.DataFrame(data)
df

         Date City  Temperature
0  2024-10-11   서울           17
1  2024-10-12   인천           18
2  2024-10-13   평택           19
3  2024-10-14   화성           81
4  2024-10-14   서울           20

In [65]:
#df.pivot(index ='Date', columns ='City', values ='Temperature') # 일부라도 중복 데이터가 있다면 오류가 난다.
# pivot_table(index, column, value)
df.pivot_table(index = 'Date',
               columns = 'City',
               values = 'Temperature'
)

City          서울    인천    평택    화성
Date
2024-10-11  17.0   NaN   NaN   NaN
2024-10-12   NaN  18.0   NaN   NaN
2024-10-13   NaN   NaN  19.0   NaN
2024-10-14  20.0   NaN   NaN  81.0

In [42]:
data = {
    '날짜': [
        '2024-01-01', '2024-01-01', '2024-01-01', '2024-01-01',
        '2024-01-02', '2024-01-02', '2024-01-02', '2024-01-02',
        '2024-01-03', '2024-01-03'
    ],
    '상품': [
        '아이폰 14', '갤럭시 S23', '아이패드 프로', '아이폰 14',
        '아이폰 14', '갤럭시 S23', '아이패드 프로', '갤럭시 S23',
        '맥북 프로', '아이폰 14'
    ],
    '판매량': [15, 30, 5, 10, 20, 25, 10, 5, 8, 12],
    '가격': [1000, 900, 800, 1000, 1000, 900, 800, 900, 2000, 1000]
}
df = pd.DataFrame(data)
df

           날짜       상품  판매량    가격
0  2024-01-01   아이폰 14   15  1000
1  2024-01-01  갤럭시 S23   30   900
2  2024-01-01  아이패드 프로    5   800
3  2024-01-01   아이폰 14   10  1000
4  2024-01-02   아이폰 14   20  1000
5  2024-01-02  갤럭시 S23   25   900
6  2024-01-02  아이패드 프로   10   800
7  2024-01-02  갤럭시 S23    5   900
8  2024-01-03    맥북 프로    8  2000
9  2024-01-03   아이폰 14   12  1000

In [45]:
df.pivot_table(index ='날짜',
               columns = '상품',
               values= '판매량',
               aggfunc='sum', # 지정 안해주면 기본값이 평균으로 나와버림
               fill_value=0,
               margins=True
)

상품          갤럭시 S23  맥북 프로  아이패드 프로  아이폰 14  All
날짜
2024-01-01       30      0        5      25   60
2024-01-02       30      0       10      20   60
2024-01-03        0      8        0      12   20
All              60      8       15      57  140

In [69]:
# titanic 승객 데이터에서 성별, 클래스 별 생존율을 출력
df = pd.read_csv('data/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [72]:
df.pivot_table(index ='Sex',
               columns = 'Pclass',
               values= 'Survived',
               #aggfunc='sum', # 지정 안해주면 기본값이 평균으로 나와버림 # or aggfunc='mean'
               fill_value=0,
               margins=True
)

Pclass         1         2         3       All
Sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838